Revit 2027 API
EnergyDataSettings.GetFromDocument Method
Note: This API is now obsolete.
 Every project document has a EnergyDataSettings element. Family documents do not have EnergyDataSettings elements.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This function is deprecated in Revit 2027 and may be removed in a later version of Revit. Use getEnergyDataSettings instead.")]
public static EnergyDataSettings GetFromDocument(
	Document cda
)
<ObsoleteAttribute("This function is deprecated in Revit 2027 and may be removed in a later version of Revit. Use getEnergyDataSettings instead.")>
Public Shared Function GetFromDocument (
	cda As Document
) As EnergyDataSettings
public:
[ObsoleteAttribute(L"This function is deprecated in Revit 2027 and may be removed in a later version of Revit. Use getEnergyDataSettings instead.")]
static EnergyDataSettings^ GetFromDocument(
	Document^ cda
)
[<ObsoleteAttribute("This function is deprecated in Revit 2027 and may be removed in a later version of Revit. Use getEnergyDataSettings instead.")>]
static member GetFromDocument :
        cda : Document -> EnergyDataSettings
Parameters
cda Document
 The document.
Return Value
EnergyDataSettings
 Returns the EnergyDataSettings element or NULL.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace